#+STARTUP=showeverything
#+BLOG: myblog
#+POSTID: 35
#+ORG2BLOG:

#+DATE: [2020-04-12 Sun 20:04]
#+OPTIONS: toc:nil num:nil todo:nil pri:nil tags:nil ^:nil
#+CATEGORY: Uncategorized, Hello
#+TAGS:
#+DESCRIPTION:
#+TITLE: linux源码目录

** udevadm
   #+BEGIN_SRC quote
   需要开启udev守护进程
   #+END_SRC
   查看相关udev守护进程的状态以及监听USB外设的信息
   #+BEGIN_SRC sh
     systemctl status udev &&
     udevadm monitor
   #+END_SRC
   查看usb设备
   #+BEGIN_SRC sh
     lsusb
   #+END_SRC

   #+RESULTS:
   | Bus | 2 | Device | 001: | ID | 1d6b:0003 | Linux   | Foundation    | 3.0    | root       | hub  |        |            |
   | Bus | 1 | Device | 005: | ID | 0bda:0129 | Realtek | Semiconductor | Corp.  | RTS5129    | Card | Reader | Controller |
   | Bus | 1 | Device | 004: | ID | 5986:0702 | Acer,   | Inc           | Lenovo | EasyCamera |      |        |            |
   | Bus | 1 | Device | 003: | ID | 8087:0a2a | Intel   | Corp.         |        |            |      |        |            |
   | Bus | 1 | Device | 010: | ID | 256c:006d | HUION   | Huion         | Tablet |            |      |        |            |
   | Bus | 1 | Device | 001: | ID | 1d6b:0002 | Linux   | Foundation    | 2.0    | root       | hub  |        |            |

   查看usb控制器信息
   #+BEGIN_SRC sh
     lspci | grep USB
   #+END_SRC

   #+RESULTS:
   : 00:14.0 USB controller: Intel Corporation 100 Series/C230 Series Chipset Family USB 3.0 xHCI Controller (rev 31)

** dd
   创建img镜像文件
   #+BEGIN_SRC sh
     dd bs=512 count=2880 if=/dev/zero of=floppy.img
     #dd if=/dev/zero of=img.1440 bs=1k count=1440   
     mkfs.ext2 img.1440
     file img.1440
   #+END_SRC

   #+RESULTS:
   | Discarding | device      | blocks: | done |            |              |           |                                           |        |        |
   | Creating   | filesystem  | with    | 360                | 4k         | blocks       | and       | 192                                       | inodes |        |
   |            |             |         |                    |            |              |           |                                           |        |        |
   | Allocating | group       | tables: | 0/1          | done |              |           |                                           |        |        |
   | Writing    | inode       | tables: | 0/1          | done |              |           |                                           |        |        |
   | Writing    | superblocks | and     | filesystem         | accounting | information: | 0/1 | done                                |        |        |
   |            |             |         |                    |            |              |           |                                           |        |        |
   | img.1440:  | Linux       | rev     | 1.0                | ext2       | filesystem   | data,     | UUID=24759fdf-15f7-4a2f-b579-9dabbc9ef54c | (large | files) |
   
** iproute2
   设置删除ip地址
   #+BEGIN_SRC sh
     ip addr add
     ip addr show 
     ip addr del
   #+END_SRC

   #+BEGIN_SRC sh
     ip route show
     ip route get 
   #+END_SRC
   更改默认路由
   #+BEGIN_SRC sh
     ip route add default 
   #+END_SRC
   显示网络统计数据
   #+BEGIN_SRC sh
     ip -s -s link ls wlp7s0
   #+END_SRC
   ARP条目
   #+BEGIN_SRC sh
   ip neighbour
   #+END_SRC

   #+RESULTS:
   : 192.168.1.1 dev wlp7s0 lladdr bc:5f:f6:80:45:33 STALE

   监控netlink消息
   #+BEGIN_SRC sh
     ip monitor all
   #+END_SRC
   激活停止网络接口
  #+BEGIN_SRC sh
     ip link set devname down
     ip link set devname up
   #+END_SRC

